In [1]:
import pandas as pd

In [4]:
df=pd.read_excel("Movie.xlsx")

In [5]:
df.head()

   s.no    Name Qualifier
0     1  Rajesh      pass
1     2   jithu      fail
2     3  chinni      fail
3     4   laddu      pass
4     5    meee      pass

In [7]:
df['Qualifier'].value_counts()#returns me count of each category

pass    3
fail    2
Name: Qualifier, dtype: int64

In [8]:
encode={'Qualifier':{"pass":1,
    "fail":0}
}

In [9]:
encoded_df=df.replace(encode)

In [10]:
encoded_df

   s.no    Name  Qualifier
0     1  Rajesh          1
1     2   jithu          0
2     3  chinni          0
3     4   laddu          1
4     5    meee          1

In [11]:
output=encoded_df.to_excel('data.xlsx')

In [12]:
pd.read_excel('data.xlsx')

   Unnamed: 0  s.no    Name  Qualifier
0           0     1  Rajesh          1
1           1     2   jithu          0
2           2     3  chinni          0
3           3     4   laddu          1
4           4     5    meee          1

In [14]:
df.head(3)

   s.no    Name Qualifier
0     1  Rajesh      pass
1     2   jithu      fail
2     3  chinni      fail

In [15]:
data=pd.read_excel("Movie.xlsx")

In [16]:
data.head(7)

   s.no    Name Qualifier
0     1  Rajesh      pass
1     2   jithu      fail
2     3  chinni      fail
3     4   laddu      pass
4     5    meee      pass

In [18]:
type(data['Qualifier'])

pandas.core.series.Series

In [19]:
data.dtypes

s.no          int64
Name         object
Qualifier    object
dtype: object

In [20]:
data['Qualifier']=data['Qualifier'].astype('category')

In [21]:
data.dtypes

s.no            int64
Name           object
Qualifier    category
dtype: object

In [22]:
data['Qualifier_new']=data['Qualifier'].cat.codes

In [23]:
data

   s.no    Name Qualifier  Qualifier_new
0     1  Rajesh      pass              1
1     2   jithu      fail              0
2     3  chinni      fail              0
3     4   laddu      pass              1
4     5    meee      pass              1

In [24]:
"""
Create a dataset  of home 
-sno. rooms    doors  windows
 1    dinning   two     four
"""

'\nCreate a dataset  of home \n-sno. rooms    doors  windows\n 1    dinning   two     four\n'

In [26]:
pd.get_dummies(data, columns=['Qualifier']).head()
#dummy data- collide, misinterpretedfrom sk

   s.no    Name  Qualifier_new  Qualifier_fail  Qualifier_pass
0     1  Rajesh              1               0               1
1     2   jithu              0               1               0
2     3  chinni              0               1               0
3     4   laddu              1               0               1
4     5    meee              1               0               1

In [27]:
from sklearn.preprocessing import OrdinalEncoder

In [28]:
obj=OrdinalEncoder()#creating object of encoder

In [29]:
data['encode']=obj.fit_transform(data[['Qualifier']])

In [30]:
data.head(7)

   s.no    Name Qualifier  Qualifier_new  encode
0     1  Rajesh      pass              1     1.0
1     2   jithu      fail              0     0.0
2     3  chinni      fail              0     0.0
3     4   laddu      pass              1     1.0
4     5    meee      pass              1     1.0

In [31]:
data.value_counts

<bound method DataFrame.value_counts of    s.no    Name Qualifier  Qualifier_new  encode
0     1  Rajesh      pass              1     1.0
1     2   jithu      fail              0     0.0
2     3  chinni      fail              0     0.0
3     4   laddu      pass              1     1.0
4     5    meee      pass              1     1.0>